1s/ERP/Conf/Enums/СтатусыРеализацийТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыРеализацийТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КПредоплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/СтатусыРеализацийТоваровУслуг/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	
	Если (Параметры.Свойство("ПоказатьВсе") И Параметры.ПоказатьВсе)
		ИЛИ ((Параметры.Свойство("РеализацияПоЗаказам") И НЕ Параметры.РеализацияПоЗаказам) 
			И НЕ (Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
				ИЛИ Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионера
				ИЛИ Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности)) Тогда
		ДанныеВыбора.Добавить(Перечисления.СтатусыРеализацийТоваровУслуг.КПредоплате);
	КонецЕсли;
	Если (Параметры.Свойство("ПереходПравСобственности") И Параметры.ПереходПравСобственности)
		ИЛИ (Параметры.Свойство("ХозяйственнаяОперация") 
			И (Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности
				ИЛИ Параметры.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионераБезПереходаПраваСобственности)) Тогда
		ДанныеВыбора.Добавить(Перечисления.СтатусыРеализацийТоваровУслуг.ВПути);
	КонецЕсли;
	ДанныеВыбора.Добавить(Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено);
	
КонецПроцедуры

#КонецОбласти
